``` sql
CREATE TABLE cities ( id INTEGER PRIMARY KEY, name TEXT, pincode INTEGER, state TEXT);

INSERT INTO cities VALUES (1 , 'Mumbai', 400001, 'Maharashtra');

INSERT INTO cities VALUES (2 , 'Chennai', 600001, 'Tamil Nadu');

INSERT INTO cities VALUES (3 , 'Kolkata', 700001, 'West Bengal');
```

-1- UPDATE statement

- to modify existing rows in a table

``` sql
/* UPDATE statement syntax */
UPDATE table_name SET col1 = value1 , col2 = value2 WHERE condition ;

UPDATE cities SET name = 'Calcutta' WHERE id = 3 ;
SELECT * FROM cities
```

WHERE condition is optional 
``` sql
UPDATE cities SET pincode = pincode + 1 ;
SELECT * FROM cities ;
```

-2- DELETE statement

- to delete rows from a table

``` sql
/* DELETE statement syntax */
DELETE FROM table_name WHERE condition ;

DELETE FROM cities WHERE id = 3 ;
SELECT * FROM cities
```

Here WHERE clause is optional. So if WHERE clause is not written then it will delete all the rows.
``` sql
/* Code given below will delete all the rows in a table */
DELETE FROM cities ;
SELECT * FROM cities 
```

-3- TRUNCATE statement

- to delete all the rows from table and free the space containing table
(Difference between DELETE and TRUNCATE is that DELETE can delete all the rows if no condition is specified but does not free the space unlike TRUNCATE space.)

``` sql
/* TRUNCATE statement syntax */
TRUNCATE TABLE table_name ;

TRUNCATE TABLE cities ;
SELECT * FROM students
```

-4- DROP statement

- deletes all the rows and table-structure is removed
- all relationships with other tables will no longer be valid. Integrity constraints woll be dropped which is not the case when TRUNCATE statement is used

``` sql
/* DROP statement synrax*/ 
DROP TABLE table_name ;

DROP TABLE cities ;
SELECT * FROM cities
```

When we try to select all the rows after DROP statement, it fetches error unlike in case of TRUNCATE statement.

-5- CREATE statement

- to create table with column names along with datatype of each column

- Integrity constraints like primary key, foreign key, unique key can also be defined for columns while creating table

``` sql
CREATE TABLE students ( id INTEGER PRIMARY KEY, name TEXT, age INTEGER, grade TEXT, marks INTEGER);

INSERT INTO students VALUES (1 , 'Rahul', 10, 'A', 95);

INSERT INTO students VALUES (2 , 'Radhika', 11, 'B', 75);

INSERT INTO students VALUES (3 , 'Ramesh', 12, 'B', 78);
```

-6- DISTINCT statement

- to choose unique values in row

``` sql
SELECT DISTINCT grade FROM students
```

-7- ALTER statement

- add or drop table columns

``` sql
/* ALTER statement syntax*/
ALTER TABLE table_name ADD/MODIFY column_name datatype ;

ALTER TABLE students ADD games TEXT ;

SELECT * FROM students
```

``` sql
ALTER TABLE table_name DROP column_name ;

ALTER TABLE students DROP games ;

SELECT * FROM students
```

-8- RENAME statement

- change the name of table

``` sql
/* RENAME statement syntax */
ALTER TABLE old_table_name RENAME TO new_table_name ;

ALTER TABLE students RENAME  TO catalogue ;

SELECT * FROM catalogue 
```